app/Controllers/productosController.php

SELECT *
FROM `producto`
WHERE LOWER(descripcion) LIKE '%vol%'
---
    private function cargarProductos($categoria = null, $busqueda = null)
    {
        $conditions = [];

        // Filtrar por categoría
        if ($categoria) {
            $conditions['idCategoria'] = intval($categoria); // Filtrar por categoría seleccionada
        }

        // Filtrar por búsqueda
        if ($busqueda) {
            $conditions['LOWER(descripcion) LIKE'] = '%' . strtolower($busqueda) . '%';
        }

        return $this->productoModel->where($conditions)->findAll(); // Retornar productos filtrados

SELECT *
FROM `categoria`
---
    public function obtenerCategorias()
    {
        return $this->categoriaModel->findAll();